Repository: E-m-i-n-e-n-c-e/hello_truck_driver
Catalog: lib/l10n/app_*.arb
Languages: hi, ta

# appTitle
source: Hello Truck Driver
hi: हेलो ट्रक ड्राइवर
ta: ஹலோ டிரக் டிரைவர்

# languageSystem
source: System Default
hi: सिस्टम डिफ़ॉल्ट
ta: சிஸ்டம் இயல்புநிலை

# languageTitle
source: Language
hi: भाषा
ta: மொழி

# currentLanguage
source: English
hi: हिन्दी
ta: தமிழ்

# loginTitle
source: Enter your phone number
hi: अपना फ़ोन नंबर दर्ज करें
ta: உங்கள் தொலைபேசி எண்ணை உள்ளிடவும்

# loginSubtitle
source: We'll send you a verification code
hi: हम आपको एक सत्यापन कोड भेजेंगे
ta: நாங்கள் உங்களுக்கு சரிபார்ப்பு குறியீட்டை அனுப்புவோம்

# phoneNumberHint
source: Phone Number
hi: फ़ोन नंबर
ta: தொலைபேசி எண்

source: Send OTP
hi: OTP भेजें
ta: OTP அனுப்பு

# phoneEmptyError
source: Please enter your phone number
hi: कृपया अपना फ़ोन नंबर दर्ज करें
ta: உங்கள் தொலைபேசி எண்ணை உள்ளிடவும்

# phoneInvalidError
source: Please enter a valid 10-digit phone number
hi: कृपया एक मान्य 10-अंकीय फ़ोन नंबर दर्ज करें
ta: சரியான 10 இலக்க தொலைபேசி எண்ணை உள்ளிடவும்

# errorSendingOtp
source: Error sending OTP: {error}
hi: OTP भेजने में त्रुटि: {error}
ta: OTP அனுப்புவதில் பிழை: {error}

source: OTP Verification
hi: OTP सत्यापन
ta: OTP சரிபார்ப்பு

# otpSentTo
source: We have sent a verification code to
hi: हमने एक सत्यापन कोड भेजा है
ta: நாங்கள் சரிபார்ப்பு குறியீட்டை அனுப்பியுள்ளோம்

# otpSentSuccess
source: OTP sent successfully!
hi: OTP सफलतापूर्वक भेजा गया!
ta: OTP வெற்றிகரமாக அனுப்பப்பட்டது!

# checkTextMessages
source: Check text messages for your OTP
hi: अपने OTP के लिए टेक्स्ट संदेश देखें
ta: உங்கள் OTP க்கு குறுஞ்செய்திகளைப் பார்க்கவும்

# didntGetOtp
source: Didn't get the OTP?
hi: OTP नहीं मिला?
ta: OTP கிடைக்கவில்லையா?

source: Resend SMS
hi: SMS पुनः भेजें
ta: SMS மீண்டும் அனுப்பு

# resendSmsIn
source: Resend SMS in {seconds}s
hi: {seconds}s में SMS पुनः भेजें
ta: {seconds}s இல் SMS மீண்டும் அனுப்பு

source: Change phone number
hi: फ़ोन नंबर बदलें
ta: தொலைபேசி எண்ணை மாற்று

# errorVerifyingOtp
source: Error verifying OTP: {error}
hi: OTP सत्यापन में त्रुटि: {error}
ta: OTP சரிபார்ப்பதில் பிழை: {error}

source: Profile
hi: प्रोफाइल
ta: சுயவிவரம்

source: Failed to load profile
hi: प्रोफाइल लोड करने में विफल
ta: சுயவிவரத்தை ஏற்றுவதில் தோல்வி

source: Retry
hi: पुनः प्रयास करें
ta: மீண்டும் முயற்சி

source: Wallet Balance
hi: वॉलेट बैलेंस
ta: வாலட் இருப்பு

source: Documents
hi: दस्तावेज़
ta: ஆவணங்கள்

# documentsSubtitle
source: License, RC, Insurance & more
hi: लाइसेंस, RC, बीमा और अधिक
ta: உரிமம், RC, காப்பீடு மற்றும் பல

source: Vehicle
hi: वाहन
ta: வாகனம்

# vehicleSubtitle
source: Vehicle details & owner info
hi: वाहन विवरण और मालिक की जानकारी
ta: வாகன விவரங்கள் மற்றும் உரிமையாளர் தகவல்

source: Address
hi: पता
ta: முகவரி

# addressSubtitle
source: Your registered address
hi: आपका पंजीकृत पता
ta: உங்கள் பதிவு செய்யப்பட்ட முகவரி

# languageSubtitle
source: Change app language
hi: ऐप भाषा बदलें
ta: ஆப் மொழியை மாற்று

source: Personal Information
hi: व्यक्तिगत जानकारी
ta: தனிப்பட்ட தகவல்

source: First Name
hi: पहला नाम
ta: முதல் பெயர்

source: Last Name
hi: अंतिम नाम
ta: கடைசி பெயர்

source: Alternate Phone
hi: वैकल्पिक फोन
ta: மாற்று தொலைபேசி

source: Not set
hi: सेट नहीं
ta: அமைக்கப்படவில்லை

source: Account
hi: खाता
ta: கணக்கு

source: Phone Number
hi: फ़ोन नंबर
ta: தொலைபேசி எண்

source: Email
hi: ईमेल
ta: மின்னஞ்சல்

source: Not linked
hi: लिंक नहीं
ta: இணைக்கப்படவில்லை

source: Link
hi: लिंक
ta: இணை

source: Member Since
hi: सदस्य बने
ta: உறுப்பினர் ஆனது

source: Referral Code
hi: रेफरल कोड
ta: பரிந்துரை குறியீடு

source: Edit
hi: संपादित करें
ta: திருத்து

source: Add
hi: जोड़ें
ta: சேர்

source: Logout
hi: लॉगआउट
ta: வெளியேறு

# logoutConfirmTitle
source: Logout
hi: लॉगआउट
ta: வெளியேறு

# logoutConfirmMessage
source: Are you sure you want to logout?
hi: क्या आप सुनिश्चित हैं कि आप लॉगआउट करना चाहते हैं?
ta: நீங்கள் நிச்சயமாக வெளியேற விரும்புகிறீர்களா?

source: Cancel
hi: रद्द करें
ta: ரத்து

source: OK
hi: ठीक है
ta: சரி

source: Pending Verification
hi: सत्यापन लंबित
ta: சரிபார்ப்பு நிலுவையில்

source: Verified
hi: सत्यापित
ta: சரிபார்க்கப்பட்டது

source: Verification Rejected
hi: सत्यापन अस्वीकृत
ta: சரிபார்ப்பு நிராகரிக்கப்பட்டது

# profilePictureUpdated
source: Profile picture updated successfully
hi: प्रोफाइल फोटो सफलतापूर्वक अपडेट किया गया
ta: சுயவிவர படம் வெற்றிகரமாக புதுப்பிக்கப்பட்டது

# emailLinkedSuccess
source: Email Linked Successfully
hi: ईमेल सफलतापूर्वक लिंक हो गया
ta: மின்னஞ்சல் வெற்றிகரமாக இணைக்கப்பட்டது

# firstNameUpdated
source: First name updated successfully
hi: पहला नाम सफलतापूर्वक अपडेट किया गया
ta: முதல் பெயர் வெற்றிகரமாக புதுப்பிக்கப்பட்டது

# lastNameUpdated
source: Last name updated successfully
hi: अंतिम नाम सफलतापूर्वक अपडेट किया गया
ta: கடைசி பெயர் வெற்றிகரமாக புதுப்பிக்கப்பட்டது

# alternatePhoneUpdated
source: Alternate phone updated successfully
hi: वैकल्पिक फ़ोन सफलतापूर्वक अपडेट किया गया
ta: மாற்று தொலைபேசி வெற்றிகரமாக புதுப்பிக்கப்பட்டது

# failedToUpdate
source: Failed to update {field}: {error}
hi: {field} अपडेट करने में विफल: {error}
ta: {field} புதுப்பிப்பதில் தோல்வி: {error}

source: Dashboard
hi: डैशबोर्ड
ta: டாஷ்போர்டு

source: Home
hi: होम
ta: முகப்பு

source: Rides
hi: राइड्स
ta: பயணங்கள்

source: Earnings
hi: कमाई
ta: வருமானம்

# helloDriver
source: Hello, {name} 👋
hi: नमस्ते, {name} 👋
ta: வணக்கம், {name} 👋

source: Stay ready. Earn more.
hi: तैयार रहें। ज्यादा कमाएं।
ta: தயாராக இருங்கள். அதிகம் சம்பாதியுங்கள்.

source: Today's Summary
hi: आज का सारांश
ta: இன்றைய சுருக்கம்

# ridesLabel
source: rides
hi: राइड्स
ta: பயணங்கள்

source: earned
hi: कमाया
ta: சம்பாதித்தது

source: Status
hi: स्थिति
ta: நிலை

source: Score
hi: स्कोर
ta: மதிப்பெண்

source: Today's Rides
hi: आज की राइड्स
ta: இன்றைய பயணங்கள்

source: No rides completed yet
hi: अभी तक कोई राइड पूरी नहीं हुई
ta: இன்னும் பயணங்கள் முடிக்கப்படவில்லை

# completeFirstRide
source: Complete your first ride today!
hi: आज अपनी पहली राइड पूरी करें!
ta: இன்று உங்கள் முதல் பயணத்தை முடியுங்கள்!

source: Booking #{number}
hi: बुकिंग #{number}
ta: புக்கிங் #{number}

source: Completed
hi: पूर्ण
ta: முடிந்தது

source: Dismiss
hi: खारिज करें
ta: நிராகரி

source: Document Expired!
hi: दस्तावेज़ समाप्त!
ta: ஆவணம் காலாவதியானது!

source: Document Expiring Soon
hi: दस्तावेज़ जल्द समाप्त हो रहा है
ta: ஆவணம் விரைவில் காலாவதியாகும்

# cannotTakeBookings
source: You cannot take bookings until documents are updated.
hi: दस्तावेज़ अपडेट होने तक आप बुकिंग नहीं ले सकते।
ta: ஆவணங்கள் புதுப்பிக்கப்படும் வரை புக்கிங்குகளை எடுக்க முடியாது.

source: Turn on Location Services
hi: लोकेशन सेवाएं चालू करें
ta: இருப்பிட சேவைகளை இயக்கு

# locationServicesOffMessage
source: Location services are off. Without location, you won't be able to take rides.
hi: लोकेशन सेवाएं बंद हैं। लोकेशन के बिना, आप राइड नहीं ले पाएंगे।
ta: இருப்பிட சேவைகள் முடக்கப்பட்டுள்ளன. இருப்பிடம் இல்லாமல், பயணங்களை எடுக்க முடியாது.

source: Open Settings
hi: सेटिंग्स खोलें
ta: அமைப்புகளைத் திற

source: Skip for now
hi: अभी के लिए छोड़ें
ta: இப்போதைக்கு தவிர்

source: Enable Location Permission
hi: लोकेशन परमिशन सक्षम करें
ta: இருப்பிட அனுமதியை இயக்கு

# locationPermissionMessage
source: We need your location to assign rides. You won't be able to take rides otherwise.
hi: हमें राइड असाइन करने के लिए आपकी लोकेशन चाहिए। अन्यथा आप राइड नहीं ले पाएंगे।
ta: பயணங்களை ஒதுக்க உங்கள் இருப்பிடம் தேவை. இல்லையெனில் பயணங்களை எடுக்க முடியாது.

source: Enable
hi: सक्षम करें
ta: இயக்கு

source: Location Permission Required
hi: स्थान अनुमति आवश्यक है
ta: இருப்பிட அனுமதி தேவை

# locationPermissionDeniedMessage
source: Permission is permanently denied. Open app settings to allow location. Without this, you won't be able to take rides.
hi: परमिशन स्थायी रूप से अस्वीकृत है। लोकेशन की अनुमति देने के लिए ऐप सेटिंग्स खोलें। इसके बिना, आप राइड नहीं ले पाएंगे।
ta: அனுமதி நிரந்தரமாக மறுக்கப்பட்டது. இருப்பிடத்தை அனுமதிக்க ஆப் அமைப்புகளைத் திறக்கவும். இது இல்லாமல், பயணங்களை எடுக்க முடியாது.

# youAreOffline
source: You are offline. Please check your internet connection.
hi: आप ऑफलाइन हैं। कृपया अपना इंटरनेट कनेक्शन चेक करें।
ta: நீங்கள் ஆஃப்லைனில் உள்ளீர்கள். உங்கள் இணைய இணைப்பைச் சரிபார்க்கவும்.

source: You are back online
hi: आप वापस ऑनलाइन हैं
ta: நீங்கள் மீண்டும் ஆன்லைனில் உள்ளீர்கள்

source: Booking Cancelled
hi: बुकिंग रद्द
ta: புக்கிங் ரத்து செய்யப்பட்டது

# bookingCancelledMessage
source: Sorry, your booking has been cancelled by the customer. You will receive some compensation for your time.
hi: क्षमा करें, आपकी बुकिंग ग्राहक द्वारा रद्द कर दी गई है। आपको अपने समय के लिए कुछ मुआवजा मिलेगा।
ta: மன்னிக்கவும், உங்கள் புக்கிங் வாடிக்கையாளரால் ரத்து செய்யப்பட்டது. உங்கள் நேரத்திற்கு சில இழப்பீடு கிடைக்கும்.

# failedToRejectBooking
source: Failed to reject booking: {error}
hi: बुकिंग अस्वीकार करने में विफल: {error}
ta: புக்கிங்கை நிராகரிப்பதில் தோல்வி: {error}

# failedToProcessBooking
source: Failed to process booking: {error}
hi: बुकिंग प्रोसेस करने में विफल: {error}
ta: புக்கிங்கை செயலாக்குவதில் தோல்வி: {error}

# error
source: Error: {message}
hi: त्रुटि: {message}
ta: பிழை: {message}

# driverStatusAvailable
source: Available
hi: उपलब्ध
ta: கிடைக்கிறது

# driverStatusUnavailable
source: Unavailable
hi: अनुपलब्ध
ta: கிடைக்கவில்லை

# driverStatusOnRide
source: On Ride
hi: राइड पर
ta: பயணத்தில்

# driverStatusRideOffered
source: Ride Offered
hi: राइड ऑफर की गई
ta: பயணம் வழங்கப்பட்டது

# bookingStatusPending
source: Pending
hi: लंबित
ta: நிலுவையில்

# bookingStatusDriverAssigned
source: Driver Assigned
hi: ड्राइवर असाइन
ta: டிரைவர் ஒதுக்கப்பட்டார்

# bookingStatusConfirmed
source: Confirmed
hi: पुष्टि
ta: உறுதிப்படுத்தப்பட்டது

# bookingStatusPickupArrived
source: Pickup Arrived
hi: पिकअप पहुंचे
ta: பிக்அப் வந்துவிட்டது

# bookingStatusPickupVerified
source: Pickup Verified
hi: पिकअप सत्यापित
ta: பிக்அப் சரிபார்க்கப்பட்டது

# bookingStatusInTransit
source: In Transit
hi: रास्ते में
ta: போக்குவரத்தில்

# bookingStatusDropArrived
source: Drop Arrived
hi: ड्रॉप पहुंचे
ta: டிராப் வந்துவிட்டது

# bookingStatusDropVerified
source: Drop Verified
hi: ड्रॉप सत्यापित
ta: டிராப் சரிபார்க்கப்பட்டது

# bookingStatusCompleted
source: Completed
hi: पूर्ण
ta: முடிந்தது

# bookingStatusCancelled
source: Cancelled
hi: रद्द
ta: ரத்து செய்யப்பட்டது

# bookingStatusExpired
source: Expired
hi: समाप्त
ta: காலாவதியானது

# assignmentStatusOffered
source: Offered
hi: ऑफर किया गया
ta: வழங்கப்பட்டது

# assignmentStatusAccepted
source: Accepted
hi: स्वीकार किया गया
ta: ஏற்றுக்கொள்ளப்பட்டது

# assignmentStatusRejected
source: Rejected
hi: अस्वीकृत
ta: நிராகரிக்கப்பட்டது

# assignmentStatusAutoRejected
source: Auto Rejected
hi: ऑटो अस्वीकृत
ta: தானாக நிராகரிக்கப்பட்டது

# transactionTypeCredit
source: Credit
hi: क्रेडिट
ta: கிரெடிட்

# transactionTypeDebit
source: Debit
hi: डेबिट
ta: டெபிட்

# transactionCategoryBookingPayment
source: Booking Payment
hi: बुकिंग भुगतान
ta: புக்கிங் பணம்

# transactionCategoryBookingRefund
source: Booking Refund
hi: बुकिंग रिफंड
ta: புக்கிங் திரும்பப்பெறுதல்

# transactionCategoryDriverPayout
source: Payout
hi: पेआउट
ta: பேஅவுட்

# transactionCategoryWalletCredit
source: Wallet Credit
hi: वॉलेट क्रेडिट
ta: வாலட் கிரெடிட்

# transactionCategoryOther
source: Other
hi: अन्य
ta: மற்றவை

# paymentMethodCash
source: Cash
hi: नकद
ta: பணம்

# paymentMethodOnline
source: Online
hi: ऑनलाइन
ta: ஆன்லைன்

# paymentMethodWallet
source: Wallet
hi: वॉलेट
ta: வாலட்

# payoutStatusPending
source: Pending
hi: लंबित
ta: நிலுவையில்

# payoutStatusProcessing
source: Processing
hi: प्रोसेसिंग
ta: செயலாக்கத்தில்

# payoutStatusCompleted
source: Completed
hi: पूर्ण
ta: முடிந்தது

# payoutStatusFailed
source: Failed
hi: विफल
ta: தோல்வி

# payoutStatusCancelled
source: Cancelled
hi: रद्द
ta: ரத்து செய்யப்பட்டது

# productTypePersonal
source: Personal
hi: व्यक्तिगत
ta: தனிப்பட்ட

# productTypeAgricultural
source: Agricultural
hi: कृषि
ta: விவசாய

# productTypeNonAgricultural
source: Non-Agricultural
hi: गैर-कृषि
ta: விவசாயமற்ற

# weightUnitQuintal
source: Quintal
hi: क्विंटल
ta: குவிண்டால்

# vehicleTypeThreeWheeler
source: Three Wheeler
hi: तीन पहिया
ta: மூன்று சக்கர வாகனம்

# vehicleTypeFourWheeler
source: Four Wheeler
hi: चार पहिया
ta: நான்கு சக்கர வாகனம்

# vehicleBodyTypeOpen
source: Open
hi: खुला
ta: திறந்த

# vehicleBodyTypeClosed
source: Closed
hi: बंद
ta: மூடிய

# fuelTypeDiesel
source: Diesel
hi: डीजल
ta: டீசல்

# fuelTypePetrol
source: Petrol
hi: पेट्रोल
ta: பெட்ரோல்

# fuelTypeEv
source: Electric
hi: इलेक्ट्रिक
ta: மின்சாரம்

# payoutMethodBankAccount
source: Bank Account
hi: बैंक खाता
ta: வங்கி கணக்கு

source: Pickup
hi: पिकअप
ta: பிக்அப்

source: Drop
hi: ड्रॉप
ta: டிராப்

source: Accept
hi: स्वीकार करें
ta: ஏற்றுக்கொள்

source: Reject
hi: अस्वीकार करें
ta: நிராகரி

source: Start Navigation
hi: नेविगेशन शुरू करें
ta: வழிசெலுத்தலைத் தொடங்கு

source: Arrived
hi: पहुंच गए
ta: வந்துவிட்டது

source: Verify OTP
hi: OTP सत्यापित करें
ta: OTP சரிபார்

source: Start Ride
hi: राइड शुरू करें
ta: பயணத்தைத் தொடங்கு

source: Complete Ride
hi: राइड पूरी करें
ta: பயணத்தை முடி

source: Collect Payment
hi: भुगतान लें
ta: பணம் வசூலி

source: Customer
hi: ग्राहक
ta: வாடிக்கையாளர்

source: Package
hi: पैकेज
ta: பொட்டலம்

source: Distance
hi: दूरी
ta: தூரம்

# estimatedTime
source: Est. Time
hi: अनुमानित समय
ta: மதிப்பிடப்பட்ட நேரம்

source: Fare
hi: किराया
ta: கட்டணம்

source: Commission
hi: कमीशन
ta: கமிஷன்

source: Net Earnings
hi: शुद्ध कमाई
ta: நிகர வருமானம்

source: Cash to Collect
hi: नकद प्राप्त करें
ta: வசூலிக்க வேண்டிய பணம்

source: Online Payment
hi: ऑनलाइन भुगतान
ta: ஆன்லைன் பணம்

source: Payment Received
hi: भुगतान प्राप्त
ta: பணம் பெறப்பட்டது

source: Confirm
hi: पुष्टि करें
ta: உறுதிப்படுத்து

source: Close
hi: बंद करें
ta: மூடு

source: Save
hi: सहेजें
ta: சேமி

source: Update
hi: अपडेट करें
ta: புதுப்பி

source: Delete
hi: हटाएं
ta: நீக்கு

source: Loading...
hi: लोड हो रहा है...
ta: ஏற்றுகிறது...

source: No data found
hi: कोई डेटा नहीं मिला
ta: தரவு இல்லை

source: Something went wrong
hi: कुछ गलत हो गया
ta: ஏதோ தவறு நடந்தது

source: Try Again
hi: पुनः प्रयास करें
ta: மீண்டும் முயற்சி

source: Success
hi: सफलता
ta: வெற்றி

source: Warning
hi: चेतावनी
ta: எச்சரிக்கை

source: Info
hi: जानकारी
ta: தகவல்

# tabActive
source: Active
hi: सक्रिय
ta: செயலில்

# tabHistory
source: History
hi: इतिहास
ta: வரலாறு

source: Failed to load active ride
hi: सक्रिय राइड लोड करने में विफल
ta: செயலில் உள்ள பயணத்தை ஏற்றுவதில் தோல்வி

source: No active rides
hi: कोई सक्रिय राइड नहीं
ta: செயலில் பயணங்கள் இல்லை

# noActiveRidesSubtitle
source: Your active rides will appear here
hi: आपकी सक्रिय राइड यहाँ दिखाई देंगी
ta: உங்கள் செயலில் பயணங்கள் இங்கே தோன்றும்

source: Failed to load ride history
hi: राइड इतिहास लोड करने में विफल
ta: பயண வரலாற்றை ஏற்றுவதில் தோல்வி

source: No ride history
hi: कोई राइड इतिहास नहीं
ta: பயண வரலாறு இல்லை

# noRideHistorySubtitle
source: Your completed rides will appear here
hi: आपकी पूर्ण राइड यहाँ दिखाई देंगी
ta: உங்கள் முடிந்த பயணங்கள் இங்கே தோன்றும்

source: Cannot Accept Rides
hi: राइड स्वीकार नहीं कर सकते
ta: பயணங்களை ஏற்க முடியாது

# youAreAvailable
source: You're available
hi: आप उपलब्ध हैं
ta: நீங்கள் கிடைக்கிறீர்கள்

# youAreUnavailable
source: You're unavailable
hi: आप अनुपलब्ध हैं
ta: நீங்கள் கிடைக்கவில்லை

# readyToAcceptRequests
source: Ready to accept new ride requests
hi: नई राइड स्वीकार करने के लिए तैयार
ta: புதிய பயண கோரிக்கைகளை ஏற்க தயார்

# turnOnToReceiveRides
source: Turn on to start receiving rides
hi: राइड प्राप्त करना शुरू करने के लिए चालू करें
ta: பயணங்களைப் பெற இயக்கு

# verificationRejectedMessage
source: Your verification was rejected. Please contact support to resolve the issue.
hi: आपका सत्यापन अस्वीकार कर दिया गया। कृपया समस्या हल करने के लिए सहायता से संपर्क करें।
ta: உங்கள் சரிபார்ப்பு நிராகரிக்கப்பட்டது. சிக்கலைத் தீர்க்க ஆதரவைத் தொடர்பு கொள்ளவும்.

# verificationPendingMessage
source: Your account is pending verification. You cannot accept rides until your documents are verified.
hi: आपका खाता सत्यापन लंबित है। दस्तावेज़ सत्यापित होने तक आप राइड स्वीकार नहीं कर सकते।
ta: உங்கள் கணக்கு சரிபார்ப்பு நிலுவையில் உள்ளது. ஆவணங்கள் சரிபார்க்கப்படும் வரை பயணங்களை ஏற்க முடியாது.

# documentsExpiredMessage
source: Your {docs} have expired. Please update them to accept rides.
hi: आपके {docs} समाप्त हो गए हैं। कृपया राइड स्वीकार करने के लिए उन्हें अपडेट करें।
ta: உங்கள் {docs} காலாவதியாகிவிட்டது. பயணங்களை ஏற்க அவற்றைப் புதுப்பிக்கவும்.

source: You are now available
hi: अब आप उपलब्ध हैं
ta: இப்போது நீங்கள் கிடைக்கிறீர்கள்

source: You are now unavailable
hi: अब आप अनुपलब्ध हैं
ta: இப்போது நீங்கள் கிடைக்கவில்லை

source: Failed to update status
hi: स्थिति अपडेट करने में विफल
ta: நிலையைப் புதுப்பிப்பதில் தோல்வி

source: Agricultural Product
hi: कृषि उत्पाद
ta: விவசாய பொருள்

source: Package Delivery
hi: पैकेज डिलीवरी
ta: பொட்டல விநியோகம்

source: Navigate to Pickup
hi: पिकअप पर नेविगेट करें
ta: பிக்அப்புக்கு வழிசெலுத்து

source: Navigate to Drop
hi: ड्रॉप पर नेविगेट करें
ta: டிராப்புக்கு வழிசெலுத்து

source: Wallet Activity
hi: वॉलेट गतिविधि
ta: வாலட் செயல்பாடு

source: Payouts
hi: भुगतान
ta: பேஅவுட்கள்

source: Failed to load wallet balance
hi: वॉलेट बैलेंस लोड करने में विफल
ta: வாலட் இருப்பை ஏற்றுவதில் தோல்வி

source: Total Balance
hi: कुल बैलेंस
ta: மொத்த இருப்பு

source: Failed to load wallet activity
hi: वॉलेट गतिविधि लोड करने में विफल
ta: வாலட் செயல்பாட்டை ஏற்றுவதில் தோல்வி

# noWalletActivity
source: No wallet activity yet
hi: अभी तक कोई वॉलेट गतिविधि नहीं
ta: இன்னும் வாலட் செயல்பாடு இல்லை

# walletActivitySubtitle
source: Your wallet transactions will appear here
hi: आपके वॉलेट लेनदेन यहाँ दिखाई देंगे
ta: உங்கள் வாலட் பரிவர்த்தனைகள் இங்கே தோன்றும்

source: Failed to load payouts
hi: भुगतान लोड करने में विफल
ta: பேஅவுட்களை ஏற்றுவதில் தோல்வி

# noPayouts
source: No payouts yet
hi: अभी तक कोई भुगतान नहीं
ta: இன்னும் பேஅவுட்கள் இல்லை

# payoutsSubtitle
source: Daily payouts will appear here
hi: दैनिक भुगतान यहाँ दिखाई देंगे
ta: தினசரி பேஅவுட்கள் இங்கே தோன்றும்

source: License
hi: लाइसेंस
ta: உரிமம்

# fc
source: Fitness Certificate
hi: फिटनेस प्रमाण पत्र
ta: தகுதி சான்றிதழ்

source: Insurance
hi: बीमा
ta: காப்பீடு

source: Pickup Location
hi: पिकअप स्थान
ta: பிக்அப் இடம்

source: Drop Location
hi: ड्रॉप स्थान
ta: டிராப் இடம்

source: Navigation
hi: नेविगेशन
ta: வழிசெலுத்தல்

source: Location
hi: स्थान
ta: இடம்

source: Navigate
hi: नेविगेट करें
ta: வழிசெலுத்து

# termsAndConditionsTitle
source: Hello Truck Navigation
hi: हैलो ट्रक नेविगेशन
ta: ஹலோ டிரக் வழிசெலுத்தல்

# termsAndConditionsCompanyName
source: Hello Truck
hi: हैलो ट्रक
ta: ஹலோ டிரக்

# failedToStartNavigation
source: Failed to start navigation session
hi: नेविगेशन सत्र शुरू करने में विफल
ta: வழிசெலுத்தல் அமர்வைத் தொடங்குவதில் தோல்வி

# routeError
source: Route error: {status}
hi: रूट त्रुटि: {status}
ta: வழி பிழை: {status}

# exitNavigationTitle
source: Exit Navigation?
hi: नेविगेशन बंद करें?
ta: வழிசெலுத்தலை விட்டு வெளியேறவா?

# exitNavigationMessage
source: This will stop navigation and location updates
hi: यह नेविगेशन और लोकेशन अपडेट रोक देगा
ta: இது வழிசெலுத்தல் மற்றும் இருப்பிட புதுப்பிப்புகளை நிறுத்தும்

source: Consequences:
hi: परिणाम:
ta: விளைவுகள்:

# warningNavigationStop
source: Navigation updates will stop
hi: नेविगेशन अपडेट रुक जाएंगे
ta: வழிசெலுத்தல் புதுப்பிப்புகள் நிறுத்தப்படும்

# warningLocationInvisible
source: Customer won't see your location
hi: ग्राहक आपकी लोकेशन नहीं देख पाएगा
ta: வாடிக்கையாளர் உங்கள் இருப்பிடத்தைப் பார்க்க முடியாது

# warningRating
source: May affect your rating
hi: आपकी रेटिंग प्रभावित हो सकती है
ta: உங்கள் மதிப்பீட்டைப் பாதிக்கலாம்

source: Exit Anyway
hi: फिर भी बाहर निकलें
ta: எப்படியும் வெளியேறு

source: Navigating to Pickup
hi: पिकअप के लिए नेविगेट कर रहे हैं
ta: பிக்அப்புக்கு வழிசெலுத்துகிறது

source: Navigating to Drop
hi: ड्रॉप के लिए नेविगेट कर रहे हैं
ta: டிராப்புக்கு வழிசெலுத்துகிறது

# enterValidEmail
source: Please enter a valid email address
hi: कृपया एक मान्य ईमेल पता दर्ज करें
ta: சரியான மின்னஞ்சல் முகவரியை உள்ளிடவும்

# completeDocumentUploads
source: Please complete all document uploads
hi: कृपया सभी दस्तावेज़ अपलोड पूरे करें
ta: அனைத்து ஆவண பதிவேற்றங்களையும் முடிக்கவும்

# completeAddressDetails
source: Please complete address details
hi: कृपया पता विवरण पूरा करें
ta: முகவரி விவரங்களை முடிக்கவும்

# completeVehicleDetails
source: Please complete vehicle details
hi: कृपया वाहन विवरण पूरा करें
ta: வாகன விவரங்களை முடிக்கவும்

# completePayoutDetails
source: Please complete payout details
hi: कृपया भुगतान विवरण पूरा करें
ta: பேஅவுட் விவரங்களை முடிக்கவும்

# failedToCompleteOnboarding
source: Failed to complete onboarding: {error}
hi: ऑनबोर्डिंग पूरा करने में विफल: {error}
ta: ஆன்போர்டிங்கை முடிப்பதில் தோல்வி: {error}

# nameStepTitle
source: What's your name?
hi: आपका नाम क्या है?
ta: உங்கள் பெயர் என்ன?

# nameStepDescription
source: This will be displayed on your driver profile and help customers identify you during their rides.
hi: यह आपके ड्राइवर प्रोफाइल पर प्रदर्शित होगा और ग्राहकों को सवारी के दौरान आपकी पहचान करने में मदद करेगा।
ta: இது உங்கள் டிரைவர் சுயவிவரத்தில் காட்டப்படும் மற்றும் பயணங்களின் போது வாடிக்கையாளர்கள் உங்களை அடையாளம் காண உதவும்.

# enterFirstName
source: Please enter your first name
hi: कृपया अपना पहला नाम दर्ज करें
ta: உங்கள் முதல் பெயரை உள்ளிடவும்

# enterLastNameOptional
source: Enter your last name (optional)
hi: अपना अंतिम नाम दर्ज करें (वैकल्पिक)
ta: உங்கள் கடைசி பெயரை உள்ளிடவும் (விருப்பம்)

# photoStepTitle
source: Add your photo
hi: अपनी फोटो जोड़ें
ta: உங்கள் புகைப்படத்தைச் சேர்க்கவும்

# photoStepDescription
source: Upload a clear, professional photo to help customers recognize you. This builds trust and makes pickups smoother.
hi: ग्राहकों को आपको पहचानने में मदद करने के लिए एक स्पष्ट, पेशेवर फोटो अपलोड करें।
ta: வாடிக்கையாளர்கள் உங்களை அடையாளம் காண தெளிவான, தொழில்முறை புகைப்படத்தைப் பதிவேற்றவும்.

source: Tap to add photo
hi: फोटो जोड़ने के लिए टैप करें
ta: புகைப்படம் சேர்க்க தட்டவும்

# uploadingPhoto
source: Uploading your photo...
hi: आपकी फोटो अपलोड की जा रही है...
ta: உங்கள் புகைப்படம் பதிவேற்றப்படுகிறது...

source: Photo selected
hi: फोटो चुनी गई
ta: புகைப்படம் தேர்ந்தெடுக்கப்பட்டது

# emailStepTitle
source: Verify your email
hi: अपना ईमेल सत्यापित करें
ta: உங்கள் மின்னஞ்சலைச் சரிபார்க்கவும்

# emailStepDescription
source: Connect with Google to verify your email address and receive important updates about your rides and earnings.
hi: अपने ईमेल पते को सत्यापित करने और अपनी सवारी और कमाई के बारे में महत्वपूर्ण अपडेट प्राप्त करने के लिए Google से कनेक्ट करें।
ta: உங்கள் மின்னஞ்சல் முகவரியைச் சரிபார்க்கவும் உங்கள் பயணங்கள் மற்றும் வருமானம் பற்றிய முக்கிய புதுப்பிப்புகளைப் பெறவும் Google உடன் இணைக்கவும்.

# emailVerifiedSuccess
source: Email Verified Successfully
hi: ईमेल सफलतापूर्वक सत्यापित किया गया
ta: மின்னஞ்சல் வெற்றிகரமாக சரிபார்க்கப்பட்டது

source: Connect with Google
hi: Google के साथ जुड़ें
ta: Google உடன் இணை

# emailStepOptional
source: This step is optional. You can skip it and verify your email later.
hi: यह चरण वैकल्पिक है। आप इसे छोड़ सकते हैं और बाद में अपना ईमेल सत्यापित कर सकते हैं।
ta: இந்த படி விருப்பமானது. நீங்கள் இதைத் தவிர்த்து பின்னர் உங்கள் மின்னஞ்சலைச் சரிபார்க்கலாம்.

# addressStepTitle
source: Enter Your Address
hi: अपना पता दर्ज करें
ta: உங்கள் முகவரியை உள்ளிடவும்

# addressStepDescription
source: Tap the search icon to search for your address and tap on the map or drag the marker to select your precise location.
hi: अपना पता खोजने के लिए खोज आइकन टैप करें और अपने सटीक स्थान का चयन करने के लिए मानचित्र पर टैप करें या मार्कर को खींचें।
ta: உங்கள் முகவரியைத் தேட தேடல் ஐகானைத் தட்டவும் மற்றும் உங்கள் துல்லியமான இருப்பிடத்தைத் தேர்ந்தெடுக்க வரைபடத்தில் தட்டவும் அல்லது மார்க்கரை இழுக்கவும்.

# searchAddress
source: Search for Address
hi: पता खोजें
ta: முகவரியைத் தேடு

# gettingLocation
source: Getting your location...
hi: स्थान प्राप्त किया जा रहा है...
ta: உங்கள் இருப்பிடத்தைப் பெறுகிறது...
