Repository: E-m-i-n-e-n-c-e/hello_truck_driver
Catalog: lib/l10n/app_*.arb
Languages: hi, ta

source: Document not found
hi: दस्तावेज़ नहीं मिला
ta: ஆவணம் கிடைக்கவில்லை

# documentNotUploadedYet
source: This document has not been uploaded yet.
hi: यह दस्तावेज़ अभी तक अपलोड नहीं किया गया है।
ta: இந்த ஆவணம் இன்னும் பதிவேற்றப்படவில்லை.

source: Loading document...
hi: दस्तावेज़ लोड हो रहा है...
ta: ஆவணம் ஏற்றப்படுகிறது...

source: Failed to load document
hi: दस्तावेज़ लोड करने में विफल
ta: ஆவணத்தை ஏற்றுவதில் தோல்வி

# checkInternetAndRetry
source: Check your internet connection and try again.
hi: अपना इंटरनेट कनेक्शन जांचें और पुनः प्रयास करें।
ta: உங்கள் இணைய இணைப்பைச் சரிபார்த்து மீண்டும் முயற்சிக்கவும்.

# failedToLoadPdf
source: Failed to load PDF: {description}
hi: PDF लोड करने में विफल: {description}
ta: PDF ஏற்றுவதில் தோல்வி: {description}

source: Loading image...
hi: छवि लोड हो रही है...
ta: படம் ஏற்றப்படுகிறது...

# documentLoadError
source: The document could not be loaded. Please check your internet connection and try again.
hi: दस्तावेज़ लोड नहीं हो सका। कृपया अपना इंटरनेट कनेक्शन जांचें और पुनः प्रयास करें।
ta: ஆவணத்தை ஏற்ற முடியவில்லை. உங்கள் இணைய இணைப்பைச் சரிபார்த்து மீண்டும் முயற்சிக்கவும்.

source: Checking location permissions...
hi: स्थान अनुमतियों की जांच हो रही है...
ta: இருப்பிட அனுமதிகளைச் சரிபார்க்கிறது...

source: Location Services Disabled
hi: स्थान सेवाएं अक्षम हैं
ta: இருப்பிட சேவைகள் முடக்கப்பட்டுள்ளன

# locationPermissionDenied
source: Location Permission Permanently Denied
hi: स्थान अनुमति स्थायी रूप से अस्वीकृत
ta: இருப்பிட அனுமதி நிரந்தரமாக மறுக்கப்பட்டது

source: Location Access Required
hi: स्थान पहुंच आवश्यक है
ta: இருப்பிட அணுகல் தேவை

# enableLocationServicesDesc
source: Please enable location services in your device settings to use this feature.
hi: इस सुविधा का उपयोग करने के लिए कृपया अपनी डिवाइस सेटिंग्स में स्थान सेवाएं सक्षम करें।
ta: இந்த அம்சத்தைப் பயன்படுத்த உங்கள் சாதன அமைப்புகளில் இருப்பிட சேவைகளை இயக்கவும்.

# needLocationAccessDesc
source: We need location access to show your current position and help you select your address accurately.
hi: हमें आपकी वर्तमान स्थिति दिखाने और आपका पता सटीक रूप से चुनने में मदद के लिए स्थान पहुंच की आवश्यकता है।
ta: உங்கள் தற்போதைய நிலையைக் காட்டவும் உங்கள் முகவரியைத் துல்லியமாகத் தேர்ந்தெடுக்க உதவ இருப்பிட அணுகல் தேவை.

# locationDeniedForeverDesc
source: Location permission has been permanently denied. Please enable it in app settings to continue.
hi: स्थान अनुमति स्थायी रूप से अस्वीकार कर दी गई है। जारी रखने के लिए कृपया इसे ऐप सेटिंग्स में सक्षम करें।
ta: இருப்பிட அனுமதி நிரந்தரமாக மறுக்கப்பட்டது. தொடர ஆப் அமைப்புகளில் இயக்கவும்.

# locationRequiredDesc
source: Location access is required for this feature to work properly.
hi: इस सुविधा के ठीक से काम करने के लिए स्थान पहुंच आवश्यक है।
ta: இந்த அம்சம் சரியாக வேலை செய்ய இருப்பிட அணுகல் தேவை.

source: Enable Location Services
hi: स्थान सेवाएं सक्षम करें
ta: இருப்பிட சேவைகளை இயக்கு

source: Grant Permission
hi: अनुमति दें
ta: அனுமதி வழங்கு

source: Request Permission
hi: अनुमति का अनुरोध करें
ta: அனுமதி கோரு

source: Check Again
hi: फिर से जांचें
ta: மீண்டும் சரிபார்

source: Actions
hi: कार्य
ta: செயல்கள்

# callContact
source: Call {name}
hi: {name} को कॉल करें
ta: {name} ஐ அழை

source: Could not make call
hi: कॉल नहीं कर सके
ta: அழைப்பு செய்ய முடியவில்லை

# markArrivalAtPickup
source: Mark arrival at pickup location
hi: पिकअप स्थान पर आगमन चिह्नित करें
ta: பிக்அப் இடத்தில் வருகையைக் குறி

source: Verify Pickup
hi: पिकअप सत्यापित करें
ta: பிக்அப் சரிபார்

source: Enter customer OTP
hi: ग्राहक OTP दर्ज करें
ta: வாடிக்கையாளர் OTP உள்ளிடவும்

# markArrivalAtDrop
source: Mark arrival at drop location
hi: ड्रॉप स्थान पर आगमन चिह्नित करें
ta: டிராப் இடத்தில் வருகையைக் குறி

source: Verify Drop
hi: ड्रॉप सत्यापित करें
ta: டிராப் சரிபார்

source: Ride Complete
hi: राइड पूर्ण
ta: பயணம் முடிந்தது

source: Ready to finish
hi: समाप्त करने के लिए तैयार
ta: முடிக்க தயார்

source: Follow the route
hi: रास्ते का पालन करें
ta: வழியைப் பின்பற்று

source: Mark Arrived
hi: पहुंचा हुआ चिह्नित करें
ta: வந்துவிட்டதாகக் குறி

source: Marked as arrived at pickup
hi: पिकअप पर पहुंचा हुआ चिह्नित किया गया
ta: பிக்அப்பில் வந்துவிட்டதாகக் குறிக்கப்பட்டது

# pickupVerificationTitle
source: Pickup Verification
hi: पिकअप सत्यापन
ta: பிக்அப் சரிபார்ப்பு

source: Pickup verified! 🎉
hi: पिकअप सत्यापित! 🎉
ta: பிக்அப் சரிபார்க்கப்பட்டது! 🎉

# invalidOtpTryAgain
source: Invalid OTP. Please try again.
hi: अमान्य OTP। कृपया पुनः प्रयास करें।
ta: தவறான OTP. மீண்டும் முயற்சிக்கவும்.

source: Marked as arrived at drop
hi: ड्रॉप पर पहुंचा हुआ चिह्नित किया गया
ta: டிராப்பில் வந்துவிட்டதாகக் குறிக்கப்பட்டது

# dropVerificationTitle
source: Drop Verification
hi: ड्रॉप सत्यापन
ta: டிராப் சரிபார்ப்பு

source: Drop verified! 🎉
hi: ड्रॉप सत्यापित! 🎉
ta: டிராப் சரிபார்க்கப்பட்டது! 🎉

source: Ride completed! 🎉
hi: राइड पूर्ण! 🎉
ta: பயணம் முடிந்தது! 🎉

source: Verify
hi: सत्यापित करें
ta: சரிபார்

# nowAvailableForRides
source: You are now available for rides
hi: अब आप राइड के लिए उपलब्ध हैं
ta: இப்போது நீங்கள் பயணங்களுக்கு கிடைக்கிறீர்கள்

# failedToMarkReady
source: Failed to mark driver as ready: {error}
hi: ड्राइवर को तैयार चिह्नित करने में विफल: {error}
ta: டிரைவரை தயார் என்று குறிப்பதில் தோல்வி: {error}

# failedToMarkPromptSeen
source: Failed to mark prompt as seen: {error}
hi: प्रॉम्प्ट को देखे गए के रूप में चिह्नित करने में विफल: {error}
ta: ப்ராம்ப்ட்டை பார்த்ததாகக் குறிப்பதில் தோல்வி: {error}

# readyToTakeRides
source: Ready to take rides today?
hi: आज राइड लेने के लिए तैयार?
ta: இன்று பயணங்களை எடுக்க தயாரா?

# startEarningDesc
source: Start earning by accepting ride requests from customers near you
hi: आपके पास के ग्राहकों से राइड अनुरोध स्वीकार करके कमाई शुरू करें
ta: உங்கள் அருகிலுள்ள வாடிக்கையாளர்களிடமிருந்து பயண கோரிக்கைகளை ஏற்று சம்பாதிக்கத் தொடங்குங்கள்

source: Get instant notifications
hi: तुरंत सूचनाएं प्राप्त करें
ta: உடனடி அறிவிப்புகளைப் பெறுங்கள்

source: Receive ride requests immediately
hi: तुरंत राइड अनुरोध प्राप्त करें
ta: உடனடியாக பயண கோரிக்கைகளைப் பெறுங்கள்

source: Find nearby rides
hi: आस-पास की राइड खोजें
ta: அருகிலுள்ள பயணங்களைக் கண்டறியுங்கள்

# connectWithCustomers
source: Connect with customers in your area
hi: अपने क्षेत्र के ग्राहकों से जुड़ें
ta: உங்கள் பகுதியில் உள்ள வாடிக்கையாளர்களுடன் இணையுங்கள்

source: Start earning today
hi: आज कमाई शुरू करें
ta: இன்று சம்பாதிக்கத் தொடங்குங்கள்

# maximizeDailyIncome
source: Maximize your daily income potential
hi: अपनी दैनिक आय क्षमता को अधिकतम करें
ta: உங்கள் தினசரி வருமான திறனை அதிகரிக்கவும்

source: Maybe later
hi: शायद बाद में
ta: பின்னர்

source: I'm ready!
hi: मैं तैयार हूं!
ta: நான் தயார்!

# changeFromRidesTab
source: You can change this anytime from the Rides tab
hi: आप इसे कभी भी राइड टैब से बदल सकते हैं
ta: பயணங்கள் தாவலில் இருந்து எப்போது வேண்டுமானாலும் மாற்றலாம்

# pleaseEnterFirstName
source: Please enter your first name
hi: कृपया अपना पहला नाम दर्ज करें
ta: உங்கள் முதல் பெயரை உள்ளிடவும்

# pleaseEnterValidPhone
source: Please enter a valid 10-digit phone number
hi: कृपया एक मान्य 10-अंकीय फ़ोन नंबर दर्ज करें
ta: சரியான 10 இலக்க தொலைபேசி எண்ணை உள்ளிடவும்

source: Please enter address line 1
hi: कृपया पता पंक्ति 1 दर्ज करें
ta: முகவரி வரி 1 உள்ளிடவும்

source: Please enter pincode
hi: कृपया पिनकोड दर्ज करें
ta: பின்கோடு உள்ளிடவும்

# pleaseEnterValidPincode
source: Please enter a valid 6-digit pincode
hi: कृपया एक मान्य 6-अंकीय पिनकोड दर्ज करें
ta: சரியான 6 இலக்க பின்கோடு உள்ளிடவும்

source: Please enter city
hi: कृपया शहर दर्ज करें
ta: நகரத்தை உள்ளிடவும்

source: Please enter district
hi: कृपया जिला दर्ज करें
ta: மாவட்டத்தை உள்ளிடவும்

source: Please enter state
hi: कृपया राज्य दर्ज करें
ta: மாநிலத்தை உள்ளிடவும்

source: Please enter vehicle number
hi: कृपया वाहन नंबर दर्ज करें
ta: வாகன எண்ணை உள்ளிடவும்

source: Please enter vehicle body length
hi: कृपया वाहन बॉडी की लंबाई दर्ज करें
ta: வாகன உடல் நீளத்தை உள்ளிடவும்

# vehicleBodyLengthMustBePositive
source: Vehicle body length must be greater than 0
hi: वाहन बॉडी की लंबाई 0 से अधिक होनी चाहिए
ta: வாகன உடல் நீளம் 0 ஐ விட அதிகமாக இருக்க வேண்டும்

# pleaseEnterValidBodyLength
source: Please enter a valid vehicle body length
hi: कृपया एक मान्य वाहन बॉडी लंबाई दर्ज करें
ta: சரியான வாகன உடல் நீளத்தை உள்ளிடவும்

source: Please select vehicle type
hi: कृपया वाहन प्रकार चुनें
ta: வாகன வகையைத் தேர்ந்தெடுக்கவும்

source: Please select vehicle model
hi: कृपया वाहन मॉडल चुनें
ta: வாகன மாடலைத் தேர்ந்தெடுக்கவும்

source: Please select vehicle body type
hi: कृपया वाहन बॉडी प्रकार चुनें
ta: வாகன உடல் வகையைத் தேர்ந்தெடுக்கவும்

source: Please select fuel type
hi: कृपया ईंधन प्रकार चुनें
ta: எரிபொருள் வகையைத் தேர்ந்தெடுக்கவும்

source: Please upload vehicle image
hi: कृपया वाहन की छवि अपलोड करें
ta: வாகன படத்தைப் பதிவேற்றவும்

source: Please enter owner name
hi: कृपया मालिक का नाम दर्ज करें
ta: உரிமையாளர் பெயரை உள்ளிடவும்

# pleaseEnterOwnerContact
source: Please enter owner contact number
hi: कृपया मालिक का संपर्क नंबर दर्ज करें
ta: உரிமையாளர் தொடர்பு எண்ணை உள்ளிடவும்

# pleaseEnterValidOwnerContact
source: Please enter a valid 10-digit owner contact number
hi: कृपया एक मान्य 10-अंकीय मालिक संपर्क नंबर दर्ज करें
ta: சரியான 10 இலக்க உரிமையாளர் தொடர்பு எண்ணை உள்ளிடவும்

source: Please enter owner address
hi: कृपया मालिक का पता दर्ज करें
ta: உரிமையாளர் முகவரியை உள்ளிடவும்

source: Please enter owner pincode
hi: कृपया मालिक का पिनकोड दर्ज करें
ta: உரிமையாளர் பின்கோடு உள்ளிடவும்

# pleaseEnterValidOwnerPincode
source: Please enter a valid 6-digit owner pincode
hi: कृपया एक मान्य 6-अंकीय मालिक पिनकोड दर्ज करें
ta: சரியான 6 இலக்க உரிமையாளர் பின்கோடு உள்ளிடவும்

source: Please enter owner city
hi: कृपया मालिक का शहर दर्ज करें
ta: உரிமையாளர் நகரத்தை உள்ளிடவும்

source: Please enter owner district
hi: कृपया मालिक का जिला दर्ज करें
ta: உரிமையாளர் மாவட்டத்தை உள்ளிடவும்

source: Please enter owner state
hi: कृपया मालिक का राज्य दर्ज करें
ta: உரிமையாளர் மாநிலத்தை உள்ளிடவும்

# pleaseUploadOwnerAadhar
source: Please upload owner Aadhar card
hi: कृपया मालिक का आधार कार्ड अपलोड करें
ta: உரிமையாளர் ஆதார் அட்டையைப் பதிவேற்றவும்

# pleaseEnterValidPan
source: Please enter a valid PAN number
hi: कृपया एक मान्य PAN नंबर दर्ज करें
ta: சரியான PAN எண்ணை உள்ளிடவும்

# pleaseUploadDrivingLicense
source: Please upload your driving license
hi: कृपया अपना ड्राइविंग लाइसेंस अपलोड करें
ta: உங்கள் ஓட்டுநர் உரிமத்தைப் பதிவேற்றவும்

# pleaseUploadRcBook
source: Please upload your RC book
hi: कृपया अपनी RC बुक अपलोड करें
ta: உங்கள் RC புத்தகத்தைப் பதிவேற்றவும்

# pleaseUploadFc
source: Please upload your FC certificate
hi: कृपया अपना FC प्रमाणपत्र अपलोड करें
ta: உங்கள் FC சான்றிதழைப் பதிவேற்றவும்

# pleaseUploadInsurance
source: Please upload your insurance certificate
hi: कृपया अपना बीमा प्रमाणपत्र अपलोड करें
ta: உங்கள் காப்பீட்டு சான்றிதழைப் பதிவேற்றவும்

# pleaseUploadAadhar
source: Please upload your Aadhar card
hi: कृपया अपना आधार कार्ड अपलोड करें
ta: உங்கள் ஆதார் அட்டையைப் பதிவேற்றவும்

# pleaseUploadEbBill
source: Please upload your electricity bill
hi: कृपया अपना बिजली बिल अपलोड करें
ta: உங்கள் மின்சார பில்லைப் பதிவேற்றவும்

# pleaseEnterPanNumber
source: Please enter your PAN number
hi: कृपया अपना PAN नंबर दर्ज करें
ta: உங்கள் PAN எண்ணை உள்ளிடவும்

source: Please enter account holder name
hi: कृपया खाता धारक का नाम दर्ज करें
ta: கணக்கு வைத்திருப்பவர் பெயரை உள்ளிடவும்

source: Please enter account number
hi: कृपया खाता संख्या दर्ज करें
ta: கணக்கு எண்ணை உள்ளிடவும்

source: Please enter IFSC code
hi: कृपया IFSC कोड दर्ज करें
ta: IFSC குறியீட்டை உள்ளிடவும்

# pleaseEnterValidIfsc
source: Please enter a valid IFSC code
hi: कृपया एक मान्य IFSC कोड दर्ज करें
ta: சரியான IFSC குறியீட்டை உள்ளிடவும்

# pleaseEnterUpiId
source: Please enter UPI ID (VPA)
hi: कृपया UPI ID (VPA) दर्ज करें
ta: UPI ID (VPA) உள்ளிடவும்

# pleaseEnterValidUpiId
source: Please enter a valid UPI ID
hi: कृपया एक मान्य UPI ID दर्ज करें
ta: சரியான UPI ID உள்ளிடவும்

source: File size must be less than 10MB
hi: फ़ाइल का आकार 10MB से कम होना चाहिए
ta: கோப்பு அளவு 10MB க்கும் குறைவாக இருக்க வேண்டும்

source: Document uploaded successfully!
hi: दस्तावेज़ सफलतापूर्वक अपलोड किया गया!
ta: ஆவணம் வெற்றிகரமாக பதிவேற்றப்பட்டது!

# licenseExpiresInDays
source: Your driving license expires in {days} days. Please renew it soon.
hi: आपका ड्राइविंग लाइसेंस {days} दिनों में समाप्त हो रहा है। कृपया इसे जल्द नवीनीकृत करें।
ta: உங்கள் ஓட்டுநர் உரிமம் {days} நாட்களில் காலாவதியாகும். விரைவில் புதுப்பிக்கவும்.

# licenseExpiresIn30Days
source: Your driving license expires in 30 days. Please renew it.
hi: आपका ड्राइविंग लाइसेंस 30 दिनों में समाप्त हो रहा है। कृपया इसे नवीनीकृत करें।
ta: உங்கள் ஓட்டுநர் உரிமம் 30 நாட்களில் காலாவதியாகும். புதுப்பிக்கவும்.

# licenseExpiresIn45Days
source: Your driving license expires in 45 days. Please renew it.
hi: आपका ड्राइविंग लाइसेंस 45 दिनों में समाप्त हो रहा है। कृपया इसे नवीनीकृत करें।
ta: உங்கள் ஓட்டுநர் உரிமம் 45 நாட்களில் காலாவதியாகும். புதுப்பிக்கவும்.

# licenseExpired
source: Your driving license has expired. Please renew it immediately.
hi: आपका ड्राइविंग लाइसेंस समाप्त हो गया है। कृपया इसे तुरंत नवीनीकृत करें।
ta: உங்கள் ஓட்டுநர் உரிமம் காலாவதியாகிவிட்டது. உடனடியாக புதுப்பிக்கவும்.

# fcExpiresInDays
source: Your fitness certificate expires in {days} days. Please renew it soon.
hi: आपका फिटनेस प्रमाणपत्र {days} दिनों में समाप्त हो रहा है। कृपया इसे जल्द नवीनीकृत करें।
ta: உங்கள் தகுதி சான்றிதழ் {days} நாட்களில் காலாவதியாகும். விரைவில் புதுப்பிக்கவும்.

# fcExpiresIn30Days
source: Your fitness certificate expires in 30 days. Please renew it.
hi: आपका फिटनेस प्रमाणपत्र 30 दिनों में समाप्त हो रहा है। कृपया इसे नवीनीकृत करें।
ta: உங்கள் தகுதி சான்றிதழ் 30 நாட்களில் காலாவதியாகும். புதுப்பிக்கவும்.

# fcExpiresIn45Days
source: Your fitness certificate expires in 45 days. Please renew it.
hi: आपका फिटनेस प्रमाणपत्र 45 दिनों में समाप्त हो रहा है। कृपया इसे नवीनीकृत करें।
ta: உங்கள் தகுதி சான்றிதழ் 45 நாட்களில் காலாவதியாகும். புதுப்பிக்கவும்.

# fcExpired
source: Your fitness certificate has expired. Please renew it immediately.
hi: आपका फिटनेस प्रमाणपत्र समाप्त हो गया है। कृपया इसे तुरंत नवीनीकृत करें।
ta: உங்கள் தகுதி சான்றிதழ் காலாவதியாகிவிட்டது. உடனடியாக புதுப்பிக்கவும்.

# insuranceExpiresInDays
source: Your insurance expires in {days} days. Please renew it soon.
hi: आपका बीमा {days} दिनों में समाप्त हो रहा है। कृपया इसे जल्द नवीनीकृत करें।
ta: உங்கள் காப்பீடு {days} நாட்களில் காலாவதியாகும். விரைவில் புதுப்பிக்கவும்.

# insuranceExpiresIn30Days
source: Your insurance expires in 30 days. Please renew it.
hi: आपका बीमा 30 दिनों में समाप्त हो रहा है। कृपया इसे नवीनीकृत करें।
ta: உங்கள் காப்பீடு 30 நாட்களில் காலாவதியாகும். புதுப்பிக்கவும்.

# insuranceExpiresIn45Days
source: Your insurance expires in 45 days. Please renew it.
hi: आपका बीमा 45 दिनों में समाप्त हो रहा है। कृपया इसे नवीनीकृत करें।
ta: உங்கள் காப்பீடு 45 நாட்களில் காலாவதியாகும். புதுப்பிக்கவும்.

# insuranceExpired
source: Your insurance has expired. Please renew it immediately.
hi: आपका बीमा समाप्त हो गया है। कृपया इसे तुरंत नवीनीकृत करें।
ta: உங்கள் காப்பீடு காலாவதியாகிவிட்டது. உடனடியாக புதுப்பிக்கவும.

# weightUnitKg
source: kg
ta: கிலோ
