Repository: E-m-i-n-e-n-c-e/hello_truck_driver
Catalog: lib/l10n/app_*.arb
Languages: hi, ta

# addressNote
source: Please enter your address as it appears on your electricity bill.
hi: कृपया अपना पता दर्ज करें जैसा कि आपके बिजली बिल पर दिखाई देता है।
ta: உங்கள் மின்சார பில்லில் தோன்றும் முகவரியை உள்ளிடவும்.

source: Address Line 1
hi: पता पंक्ति 1
ta: முகவரி வரி 1

# addressLine1Hint
source: House/Building, Street
hi: घर/भवन, सड़क
ta: வீடு/கட்டிடம், தெரு

# landmark
source: Landmark (Optional)
hi: लैंडमार्क (वैकल्पिक)
ta: அடையாளம் (விருப்பம்)

# landmarkHint
source: Near landmark or area
hi: लैंडमार्क या क्षेत्र के पास
ta: அடையாளம் அல்லது பகுதி அருகில்

source: Pincode
hi: पिनकोड
ta: பின்கோடு

# enterPincode
source: Please enter pincode
hi: कृपया पिनकोड दर्ज करें
ta: பின்கோடு உள்ளிடவும்

source: City
hi: शहर
ta: நகரம்

source: City name
hi: शहर का नाम
ta: நகர பெயர்

source: District
hi: जिला
ta: மாவட்டம்

source: District name
hi: जिले का नाम
ta: மாவட்ட பெயர்

source: State
hi: राज्य
ta: மாநிலம்

source: State name
hi: राज्य का नाम
ta: மாநில பெயர்

# vehicleStepTitle
source: Vehicle Details
hi: वाहन विवरण
ta: வாகன விவரங்கள்

# vehicleStepDescription
source: Enter your vehicle information and owner details for registration.
hi: पंजीकरण के लिए अपना वाहन विवरण और मालिक का विवरण दर्ज करें।
ta: பதிவுக்கு உங்கள் வாகன தகவல் மற்றும் உரிமையாளர் விவரங்களை உள்ளிடவும்.

source: Vehicle Number
hi: वाहन संख्या
ta: வாகன எண்

# enterVehicleNumber
source: Please enter vehicle number
hi: कृपया वाहन संख्या दर्ज करें
ta: வாகன எண்ணை உள்ளிடவும்

source: Vehicle Type
hi: वाहन प्रकार
ta: வாகன வகை

source: Vehicle Model
hi: वाहन मॉडल
ta: வாகன மாடல்

# vehicleBodyLength
source: Vehicle Body Length (ft)
hi: वाहन बॉडी की लंबाई (फीट)
ta: வாகன உடல் நீளம் (அடி)

source: Enter body length
hi: बॉडी की लंबाई दर्ज करें
ta: உடல் நீளத்தை உள்ளிடவும்

source: Vehicle Image
hi: वाहन की छवि
ta: வாகன படம்

# uploadVehicleImage
source: Please upload vehicle image
hi: कृपया वाहन छवि अपलोड करें
ta: உங்கள் வாகனத்தின் தெளிவான படத்தைப் பதிவேற்றவும்

source: Vehicle Body Type
hi: वाहन बॉडी प्रकार
ta: வாகன உடல் வகை

source: Fuel Type
hi: ईंधन प्रकार
ta: எரிபொருள் வகை

source: Vehicle Owner Details
hi: वाहन मालिक का विवरण
ta: வாகன உரிமையாளர் விவரங்கள்

source: Same as Driver
hi: ड्राइवर के समान
ta: டிரைவர் போன்றது

# sameAsDriverSubtitle
source: Vehicle owner details are same as driver
hi: वाहन मालिक का विवरण ड्राइवर के समान है
ta: வாகன உரிமையாளர் விவரங்கள் டிரைவர் போன்றது

source: Owner Name
hi: मालिक का नाम
ta: உரிமையாளர் பெயர்

# enterOwnerName
source: Please enter owner name
hi: कृपया मालिक का नाम दर्ज करें
ta: உரிமையாளர் பெயரை உள்ளிடவும்

source: Contact Number
hi: संपर्क संख्या
ta: தொடர்பு எண்

source: Enter contact number
hi: संपर्क संख्या दर्ज करें
ta: தொடர்பு எண்ணை உள்ளிடவும்

source: Owner Aadhar Card
hi: मालिक का आधार कार्ड
ta: உரிமையாளர் ஆதார் அட்டை

# uploadOwnerAadhar
source: Please upload owner Aadhar card
hi: कृपया मालिक का आधार कार्ड अपलोड करें
ta: உரிமையாளர் ஆதார் அட்டையைப் பதிவேற்றவும்

# noVehicleModels
source: No vehicle models available
hi: कोई वाहन मॉडल उपलब्ध नहीं है
ta: வாகன மாடல்கள் இல்லை

# documentsStepTitle
source: Upload Documents
hi: दस्तावेज़ अपडेट करें
ta: ஆவணங்களைப் பதிவேற்றவும்

# documentsStepDescription
source: Please upload all required documents to complete your driver profile verification.
hi: कृपया अपने ड्राइवर प्रोफ़ाइल सत्यापन को पूरा करने के लिए सभी आवश्यक दस्तावेज़ अपलोड करें।
ta: உங்கள் டிரைவர் சுயவிவர சரிபார்ப்பை முடிக்க அனைத்து தேவையான ஆவணங்களையும் பதிவேற்றவும்.

source: PAN Number
hi: पैन नंबर
ta: PAN எண்

# enterPanNumber
source: Enter your PAN number
hi: अपना पैन नंबर दर्ज करें
ta: உங்கள் PAN எண்ணை உள்ளிடவும்

source: Driving License
hi: ड्राइविंग लाइसेंस
ta: ஓட்டுநர் உரிமம்

# uploadLicense
source: Upload your valid driving license
hi: अपना वैध ड्राइविंग लाइसेंस अपलोड करें
ta: உங்கள் செல்லுபடியாகும் ஓட்டுநர் உரிமத்தைப் பதிவேற்றவும்

source: RC Book
hi: आरसी बुक
ta: RC புத்தகம்

# uploadRcBook
source: Upload your vehicle registration certificate
hi: अपने वाहन का पंजीकरण प्रमाण पत्र अपलोड करें
ta: உங்கள் வாகன பதிவு சான்றிதழைப் பதிவேற்றவும்

source: FC Certificate
hi: एफसी प्रमाण पत्र
ta: FC சான்றிதழ்

# uploadFc
source: Upload your fitness certificate
hi: अपना फिटनेस प्रमाण पत्र अपलोड करें
ta: உங்கள் தகுதி சான்றிதழைப் பதிவேற்றவும்

source: Insurance Certificate
hi: बीमा प्रमाण पत्र
ta: காப்பீட்டு சான்றிதழ்

# uploadInsurance
source: Please upload your insurance certificate
hi: कृपया अपना बीमा प्रमाण पत्र अपलोड करें
ta: உங்கள் வாகன காப்பீட்டு சான்றிதழைப் பதிவேற்றவும்

source: Aadhar Card
hi: आधार कार्ड
ta: ஆதார் அட்டை

# uploadAadhar
source: Please upload your Aadhar card
hi: कृपया अपना आधार कार्ड अपलोड करें
ta: உங்கள் ஆதார் அட்டையைப் பதிவேற்றவும்

source: Electricity Bill
hi: बिजली बिल
ta: மின்சார பில்

# uploadEbBill
source: Upload your address proof (electricity bill)
hi: अपना पता प्रमाण अपलोड करें (बिजली बिल)
ta: உங்கள் முகவரி ஆதாரத்தைப் பதிவேற்றவும் (மின்சார பில்)

source: Payout Details
hi: भुगतान विवरण
ta: பேஅவுட் விவரங்கள்

# payoutDescription
source: Choose how you want to receive payouts. You can use a bank account or a UPI ID (VPA).
hi: चुनें कि आप अपना भुगतान कैसे प्राप्त करना चाहते हैं। आप बैंक खाते या यूपीआई आईडी (वीपीए) का उपयोग कर सकते हैं।
ta: பேஅவுட்களை எவ்வாறு பெற விரும்புகிறீர்கள் என்பதைத் தேர்ந்தெடுக்கவும். வங்கி கணக்கு அல்லது UPI ID (VPA) பயன்படுத்தலாம்.

source: Bank Account
hi: बैंक खाता
ta: வங்கி கணக்கு

source: UPI (VPA)
hi: यूपीआई (वीपीए)

source: Account Holder Name
hi: खाता धारक का नाम
ta: கணக்கு வைத்திருப்பவர் பெயர்

# enterAccountHolderName
source: Please enter account holder name
hi: कृपया खाता धारक का नाम दर्ज करें
ta: கணக்கு வைத்திருப்பவர் பெயரை உள்ளிடவும்

source: Account Number
hi: खाता संख्या
ta: கணக்கு எண்

# enterAccountNumber
source: Please enter account number
hi: कृपया खाता संख्या दर्ज करें
ta: கணக்கு எண்ணை உள்ளிடவும்

source: IFSC Code
hi: आईएफएससी कोड
ta: IFSC குறியீடு

# upiId
source: UPI ID (VPA)
hi: यूपीआई आईडी (वीपीए)

# upiHint
source: e.g., username@okicici
hi: उदाहरण: username@okicici
ta: எ.கா., username@okicici

# bankDetailsNote
source: Your bank details are used only to create a secure payout account. We do not store your complete bank information.
hi: आपके बैंक विवरण का उपयोग केवल सुरक्षित भुगतान खाता बनाने के लिए किया जाता है। हम आपकी पूरी बैंक जानकारी संग्रहीत नहीं करते हैं।
ta: உங்கள் வங்கி விவரங்கள் பாதுகாப்பான பேஅவுட் கணக்கை உருவாக்க மட்டுமே பயன்படுத்தப்படுகின்றன. உங்கள் முழு வங்கி தகவலை நாங்கள் சேமிப்பதில்லை.

source: Almost done!
hi: लगभग हो गया!
ta: கிட்டத்தட்ட முடிந்தது!

# phoneStepDescription
source: Add an alternate phone number for better communication with customers. This helps ensure smooth pickups and deliveries.
hi: ग्राहकों के साथ बेहतर संचार के लिए एक वैकल्पिक फोन नंबर जोड़ें। यह सुचारू पिकअप और डिलीवरी सुनिश्चित करने में मदद करता है।
ta: வாடிக்கையாளர்களுடன் சிறந்த தொடர்புக்கு மாற்று தொலைபேசி எண்ணைச் சேர்க்கவும். இது சுமூகமான பிக்அப் மற்றும் டெலிவரிகளை உறுதி செய்ய உதவுகிறது.

# youAreAllSet
source: You're all set!
hi: आप पूरी तरह तैयार हैं!
ta: நீங்கள் தயார்!

# completeProfileDescription
source: Complete your profile to start accepting rides and earning money with Hello Truck.
hi: हैलो ट्रक के साथ सवारी स्वीकार करने और पैसे कमाने के लिए अपनी प्रोफ़ाइल पूरी करें।
ta: ஹலோ டிரக்குடன் பயணங்களை ஏற்று பணம் சம்பாதிக்க உங்கள் சுயவிவரத்தை முடிக்கவும்.

source: View
hi: देखें
ta: பார்

source: Re-upload
hi: पुनः अपलोड करें
ta: மீண்டும் பதிவேற்று

# titleAddress
source: Address
hi: पता
ta: முகவரி

# titleVehicle
source: Vehicle
hi: वाहन
ta: வாகனம்

# titleDocuments
source: Documents
hi: दस्तावेज़
ta: ஆவணங்கள்

source: Add Address
hi: पता जोड़ें
ta: முகவரி சேர்

source: Failed to load address
hi: पता लोड करने में विफल
ta: முகவரியை ஏற்றுவதில் தோல்வி

source: No address found
hi: कोई पता नहीं मिला
ta: முகவரி இல்லை

# addressFoundSubtitle
source: Add your address to continue
hi: जारी रखने के लिए अपना पता जोड़ें
ta: தொடர உங்கள் முகவரியைச் சேர்க்கவும்

# tapMapToSelect
source: Tap on map or drag marker to select location
hi: स्थान चुनने के लिए मानचित्र पर टैप करें या मार्कर खींचें
ta: இருப்பிடத்தைத் தேர்ந்தெடுக்க வரைபடத்தில் தட்டவும் அல்லது மார்க்கரை இழுக்கவும்

# fillAllRequired
source: Please fill all required fields
hi: कृपया सभी आवश्यक फ़ील्ड भरें
ta: அனைத்து தேவையான புலங்களையும் நிரப்பவும்

# addressUpdatedSuccess
source: Address updated successfully
hi: पता सफलतापूर्वक अपडेट किया गया
ta: முகவரி வெற்றிகரமாக புதுப்பிக்கப்பட்டது

# failedToSaveAddress
source: Failed to save address: {error}
hi: पता सहेजने में विफल: {error}
ta: முகவரியைச் சேமிப்பதில் தோல்வி: {error}

source: Failed to load vehicle
hi: वाहन लोड करने में विफल
ta: வாகனத்தை ஏற்றுவதில் தோல்வி

source: No vehicle found
hi: कोई वाहन नहीं मिला
ta: வாகனம் இல்லை

# completeOnboardingToAddVehicle
source: Complete your onboarding to add vehicle details
hi: वाहन विवरण जोड़ने के लिए अपना ऑनबोर्डिंग पूरा करें
ta: வாகன விவரங்களைச் சேர்க்க உங்கள் ஆன்போர்டிங்கை முடிக்கவும்

# vehicleNumberLabel
source: Vehicle Number
hi: वाहन संख्या
ta: வாகன எண்

source: Self Owned
hi: स्व-स्वामित्व
ta: சுய உரிமை

# selfOwnedDescription
source: You are the owner of this vehicle
hi: आप इस वाहन के मालिक हैं
ta: நீங்கள் இந்த வாகனத்தின் உரிமையாளர்

source: Failed to load documents
hi: दस्तावेज़ लोड करने में विफल
ta: ஆவணங்களை ஏற்றுவதில் தோல்வி

source: No documents found
hi: कोई दस्तावेज़ नहीं मिला
ta: ஆவணங்கள் இல்லை

# completeOnboardingToUploadDocuments
source: Complete your onboarding to upload documents
hi: दस्तावेज़ अपलोड करने के लिए अपना ऑनबोर्डिंग पूरा करें
ta: ஆவணங்களைப் பதிவேற்ற உங்கள் ஆன்போர்டிங்கை முடிக்கவும்

# expiredOn
source: Expired on {date}
hi: {date} को समाप्त हो गया
ta: {date} அன்று காலாவதியானது

# validUntil
source: Valid until {date}
hi: {date} तक मान्य
ta: {date} வரை செல்லுபடியாகும்

# reuploadedSuccess
source: {title} re-uploaded successfully
hi: {title} सफलतापूर्वक पुनः अपलोड किया गया
ta: {title} வெற்றிகரமாக மீண்டும் பதிவேற்றப்பட்டது

source: Select Payment Method
hi: भुगतान विधि चुनें
ta: பணம் செலுத்தும் முறையைத் தேர்ந்தெடுக்கவும்

source: Search for Address
hi: पता खोजें
ta: முகவரியைத் தேடு

# searchLocationHint
source: Search for location...
hi: स्थान खोजें...
ta: இருப்பிடத்தைத் தேடு...

# startTypingToSearch
source: Start typing to search for locations
hi: स्थान खोजने के लिए टाइप करना शुरू करें
ta: இருப்பிடங்களைத் தேட தட்டச்சு செய்யத் தொடங்கவும்

# rideCompleteTitle
source: Ride Complete!
hi: यात्रा पूर्ण!
ta: பயணம் முடிந்தது!

# packageDeliveredSuccess
source: Package delivered successfully!
hi: पैकेज सफलतापूर्वक वितरित हो गया!
ta: பொட்டலம் வெற்றிகரமாக வழங்கப்பட்டது!

# rideCompleteMessage
source: Both pickup and drop have been verified. You can now finish this ride.
hi: पिकअप और ड्रॉप दोनों सत्यापित हो चुके हैं। अब आप इस यात्रा को समाप्त कर सकते हैं।
ta: பிக்அப் மற்றும் டிராப் இரண்டும் சரிபார்க்கப்பட்டன. இப்போது இந்த பயணத்தை முடிக்கலாம்.

source: Trip Summary
hi: यात्रा सारांश
ta: பயண சுருக்கம்

source: Finish Ride
hi: राइड समाप्त करें
ta: பயணத்தை முடி

source: Not Now
hi: अभी नहीं
ta: இப்போது வேண்டாம்

# rideCompletedSuccessToast
source: Ride completed successfully!
hi: यात्रा सफलतापूर्वक पूरी हो गई!
ta: பயணம் வெற்றிகரமாக முடிந்தது!

# failedToFinishRide
source: Failed to finish ride: {error}
hi: यात्रा समाप्त करने में विफल: {error}
ta: பயணத்தை முடிப்பதில் தோல்வி: {error}

source: New Ride Request
hi: नया राइड अनुरोध
ta: புதிய பயண கோரிக்கை

# bookingNumberPrefix
source: Booking #
hi: बुकिंग #
ta: புக்கிங் #

# pickupPrefix
source: Pickup:
hi: पिकअप:
ta: பிக்அப்:

source: Accept Ride
hi: राइड स्वीकार करें
ta: பயணத்தை ஏற்றுக்கொள்

# paymentReceivedSuccess
source: Payment received successfully! 💰
hi: भुगतान सफलतापूर्वक प्राप्त हुआ! 💰
ta: பணம் வெற்றிகரமாக பெறப்பட்டது! 💰

# paymentSettledSuccess
source: Payment settled successfully! 💰
hi: भुगतान सफलतापूर्वक निपटारा हुआ! 💰
ta: பணம் வெற்றிகரமாக தீர்க்கப்பட்டது! 💰

# paymentSettlementTitle
source: Payment Settlement
hi: भुगतान निपटान
ta: பணம் தீர்வு

# checkPaymentStatusTooltip
source: Check Payment Status
hi: भुगतान स्थिति जांचें
ta: பணம் நிலையைச் சரிபார்க்கவும்

# paymentPendingTitle
source: Payment Pending
hi: भुगतान लंबित
ta: பணம் நிலுவையில்

# paymentPendingMessage
source: Customer hasn't paid yet. Choose how to receive payment below.
hi: ग्राहक ने अभी तक भुगतान नहीं किया है। भुगतान प्राप्त करने का तरीका चुनें।
ta: வாடிக்கையாளர் இன்னும் பணம் செலுத்தவில்லை. கீழே பணம் பெறும் முறையைத் தேர்ந்தெடுக்கவும்.

source: Service Cost
hi: सेवा शुल्क
ta: சேவை செலவு

source: Customer Wallet Used
hi: ग्राहक वॉलेट का उपयोग
ta: வாடிக்கையாளர் வாலட் பயன்படுத்தப்பட்டது

source: Customer Debt Recovery
hi: ग्राहक ऋण वसूली
ta: வாடிக்கையாளர் கடன் மீட்பு

source: Platform Fee ({percentage}%)
hi: प्लेटफ़ॉर्म शुल्क ({percentage}%)
ta: தளம் கட்டணம் ({percentage}%)

source: Your Earnings
hi: आपकी कमाई
ta: உங்கள் வருமானம்

source: Wallet Credit: +{amount}
hi: वॉलेट क्रेडिट: +{amount}
ta: வாலட் கிரெடிட்: +{amount}

source: Wallet Debit: {amount}
hi: वॉलेट डेबिट: {amount}
ta: வாலட் டெபிட்: {amount}

# receivedCashTitle
source: Received Cash
hi: नकद प्राप्त हुआ
ta: பணம் பெறப்பட்டது

# receivedCashSubtitle
source: I collected cash from customer
hi: मैंने ग्राहक से नकद जमा किया
ta: வாடிக்கையாளரிடமிருந்து பணம் வசூலித்தேன்

# onlinePaymentTitle
source: Customer Pays via App
hi: ग्राहक ऐप के माध्यम से भुगतान करता है
ta: வாடிக்கையாளர் ஆப் வழியாக பணம் செலுத்துகிறார்

# onlinePaymentSubtitle
source: Ask customer to pay via payment link in their app
hi: ग्राहक से उनके ऐप में भुगतान लिंक के माध्यम से भुगतान करने को कहें
ta: வாடிக்கையாளரை அவர்களின் ஆப்பில் உள்ள பணம் செலுத்தும் இணைப்பு வழியாக பணம் செலுத்தச் சொல்லுங்கள்

source: Important Information
hi: महत्वपूर्ण जानकारी
ta: முக்கிய தகவல்

# platformFeeDisclaimer
source: Platform fee ({percentage}%) is calculated on the full service cost, not the cash collected.
hi: प्लेटफ़ॉर्म शुल्क ({percentage}%) की गणना पूर्ण सेवा लागत पर की जाती है, नकद एकत्रित राशि पर नहीं।
ta: தளம் கட்டணம் ({percentage}%) முழு சேவை செலவில் கணக்கிடப்படுகிறது, வசூலிக்கப்பட்ட பணத்தில் அல்ல.

# walletAdjustmentDisclaimer
source: If customer used wallet credit, you'll receive a wallet credit. If customer had debt, extra amount collected will be debited.
hi: यदि ग्राहक ने वॉलेट क्रेडिट का उपयोग किया है, तो आपको वॉलेट क्रेडिट प्राप्त होगा। यदि ग्राहक पर ऋण था, तो अतिरिक्त एकत्रित राशि डेबिट की जाएगी।
ta: வாடிக்கையாளர் வாலட் கிரெடிட் பயன்படுத்தியிருந்தால், உங்களுக்கு வாலட் கிரெடிட் கிடைக்கும். வாடிக்கையாளருக்கு கடன் இருந்தால், கூடுதல் வசூலிக்கப்பட்ட தொகை டெபிட் செய்யப்படும்.

# exactCashCollectionWarning
source: Make sure you have collected the exact "Cash to Collect" amount shown above.
hi: सुनिश्चित करें कि आपने ऊपर दिखाए गए सटीक "नकद प्राप्त करें" राशि एकत्र की है।
ta: மேலே காட்டப்பட்ட சரியான "வசூலிக்க வேண்டிய பணம்" தொகையை வசூலித்துள்ளீர்கள் என்பதை உறுதிப்படுத்தவும்.

# confirmCashPaymentTitle
source: Confirm Cash Payment
hi: नकद भुगतान की पुष्टि करें
ta: பண பணம் செலுத்துதலை உறுதிப்படுத்தவும்

# confirmCashPaymentMessage
source: By confirming, you declare that you have received the full cash payment from the customer.
hi: पुष्टि करके, आप घोषित करते हैं कि आपने ग्राहक से पूरा नकद भुगतान प्राप्त कर लिया है।
ta: உறுதிப்படுத்துவதன் மூலம், வாடிக்கையாளரிடமிருந்து முழு பண பணம் செலுத்துதலைப் பெற்றுள்ளீர்கள் என்று அறிவிக்கிறீர்கள்.

# platformFeeDeductionMessage
source: {amount} platform fee will be deducted from your wallet
hi: {amount} प्लेटफ़ॉर्म शुल्क आपके वॉलेट से काटा जाएगा
ta: {amount} தளம் கட்டணம் உங்கள் வாலட்டிலிருந்து கழிக்கப்படும்

# platformFeeDeductionSuffix
source: platform fee will be deducted from your wallet
hi: प्लेटफ़ॉर्म शुल्क आपके वॉलेट से काटा जाएगा
ta: தளம் கட்டணம் உங்கள் வாலட்டிலிருந்து கழிக்கப்படும்

source: Re-upload {title}
hi: {title} पुनः अपलोड करें
ta: {title} மீண்டும் பதிவேற்று

# fileSizeLimit10MB
source: File size must be less than 10MB
hi: फ़ाइल का आकार 10MB से कम होना चाहिए
ta: கோப்பு அளவு 10MB க்கும் குறைவாக இருக்க வேண்டும்

# fileSizeLimit5MB
source: Image size must be less than 5MB
hi: छवि का आकार 5MB से कम होना चाहिए
ta: படம் அளவு 5MB க்கும் குறைவாக இருக்க வேண்டும்

source: Document Selected
hi: दस्तावेज़ चयनित
ta: ஆவணம் தேர்ந்தெடுக்கப்பட்டது

source: Tap to select document
hi: दस्तावेज़ चुनने के लिए टैप करें
ta: ஆவணத்தைத் தேர்ந்தெடுக்க தட்டவும்

# documentFormatHint
source: JPG, PNG, PDF (Max 10MB)
hi: JPG, PNG, PDF (अधिकतम 10MB)
ta: JPG, PNG, PDF (அதிகபட்சம் 10MB)

# docVerificationInfo
source: Document will be verified by admin. Expiry dates will be set during verification.
hi: दस्तावेज़ व्यवस्थापक द्वारा सत्यापित किया जाएगा। सत्यापन के दौरान समाप्ति तिथियां निर्धारित की जाएंगी।
ta: ஆவணம் நிர்வாகியால் சரிபார்க்கப்படும். சரிபார்ப்பின் போது காலாவதி தேதிகள் அமைக்கப்படும்.

source: Link Email Address
hi: ईमेल पता लिंक करें
ta: மின்னஞ்சல் முகவரியை இணை

# emailAlreadyLinkedMessage
source: Your email is already linked with Google. You can re-link with a different Google account if needed.
hi: आपका ईमेल पहले से ही Google के साथ लिंक है। यदि आवश्यक हो तो आप एक अलग Google खाते के साथ फिर से लिंक कर सकते हैं।
ta: உங்கள் மின்னஞ்சல் ஏற்கனவே Google உடன் இணைக்கப்பட்டுள்ளது. தேவைப்பட்டால் வேறு Google கணக்குடன் மீண்டும் இணைக்கலாம்.

# linkEmailMessage
source: Link your email with Google to receive important updates about your rides and earnings.
hi: अपनी राइड और कमाई के बारे में महत्वपूर्ण अपडेट प्राप्त करने के लिए अपने ईमेल को Google के साथ लिंक करें।
ta: உங்கள் பயணங்கள் மற்றும் வருமானம் பற்றிய முக்கிய புதுப்பிப்புகளைப் பெற உங்கள் மின்னஞ்சலை Google உடன் இணைக்கவும்.

source: Linking...
hi: लिंक हो रहा है...
ta: இணைக்கிறது...

# failedToLinkEmail
source: Failed to link email with Google: {error}
hi: Google के साथ ईमेल लिंक करने में विफल: {error}
ta: Google உடன் மின்னஞ்சலை இணைப்பதில் தோல்வி: {error}

# fieldCannotBeEmpty
source: This field cannot be empty
hi: यह फ़ील्ड खाली नहीं हो सकता
ta: இந்த புலம் காலியாக இருக்க முடியாது

# failedToSave
source: Failed to save: {error}
hi: सहेजने में विफल: {error}
ta: சேமிப்பதில் தோல்வி: {error}

source: Edit {title}
hi: {title} संपादित करें
ta: {title} திருத்து

# enterFieldHint
source: Enter your {field}
hi: अपना {field} दर्ज करें
ta: உங்கள் {field} உள்ளிடவும்

source: Update Profile Picture
hi: प्रोफ़ाइल चित्र अपडेट करें
ta: சுயவிவர படத்தைப் புதுப்பி

source: Current Picture
hi: वर्तमान चित्र
ta: தற்போதைய படம்

source: New Picture
hi: नया चित्र
ta: புதிய படம்

source: Camera
hi: कैमरा
ta: கேமரா

source: Gallery
hi: गैलरी
ta: கேலரி

source: Upload Picture
hi: चित्र अपलोड करें
ta: படத்தைப் பதிவேற்று

source: Choose Different Image
hi: एक अलग छवि चुनें
ta: வேறு படத்தைத் தேர்ந்தெடு

# firstNameMinLength
source: First name must be at least 3 characters long
hi: पहला नाम कम से कम 3 अक्षर का होना चाहिए
ta: முதல் பெயர் குறைந்தது 3 எழுத்துக்கள் இருக்க வேண்டும்

# enterValidPhone
source: Please enter a valid 10-digit phone number
hi: कृपया एक मान्य 10-अंकीय फ़ोन नंबर दर्ज करें
ta: சரியான 10 இலக்க தொலைபேசி எண்ணை உள்ளிடவும்

# enterAddressLine1
source: Please enter address line 1
hi: कृपया पता पंक्ति 1 दर्ज करें
ta: முகவரி வரி 1 உள்ளிடவும்

# enterValidPincode
source: Please enter a valid 6-digit pincode
hi: कृपया एक मान्य 6-अंकीय पिनकोड दर्ज करें
ta: சரியான 6 இலக்க பின்கோடு உள்ளிடவும்

# enterCity
source: Please enter city
hi: कृपया शहर दर्ज करें
ta: நகரத்தை உள்ளிடவும்

# enterDistrict
source: Please enter district
hi: कृपया जिला दर्ज करें
ta: மாவட்டத்தை உள்ளிடவும்

# enterState
source: Please enter state
hi: कृपया राज्य दर्ज करें
ta: மாநிலத்தை உள்ளிடவும்

# enterVehicleBodyLength
source: Please enter vehicle body length
hi: कृपया वाहन की लंबाई दर्ज करें
ta: வாகன உடல் நீளத்தை உள்ளிடவும்

# vehicleBodyLengthGreaterThanZero
source: Vehicle body length must be greater than 0
hi: वाहन की लंबाई 0 से अधिक होनी चाहिए
ta: வாகன உடல் நீளம் 0 ஐ விட அதிகமாக இருக்க வேண்டும்

# enterValidVehicleBodyLength
source: Please enter a valid vehicle body length
hi: कृपया एक मान्य वाहन लंबाई दर्ज करें
ta: சரியான வாகன உடல் நீளத்தை உள்ளிடவும்

# selectVehicleType
source: Please select vehicle type
hi: कृपया वाहन प्रकार चुनें
ta: வாகன வகையைத் தேர்ந்தெடுக்கவும்

# selectVehicleModel
source: Please select vehicle model
hi: कृपया वाहन मॉडल चुनें
ta: வாகன மாடலைத் தேர்ந்தெடுக்கவும்

# selectVehicleBodyType
source: Please select vehicle body type
hi: कृपया वाहन बॉडी प्रकार चुनें
ta: வாகன உடல் வகையைத் தேர்ந்தெடுக்கவும்

# selectFuelType
source: Please select fuel type
hi: कृपया ईंधन प्रकार चुनें
ta: எரிபொருள் வகையைத் தேர்ந்தெடுக்கவும்

# enterOwnerContact
source: Please enter owner contact number
hi: कृपया मालिक का संपर्क नंबर दर्ज करें
ta: உரிமையாளர் தொடர்பு எண்ணை உள்ளிடவும்

# enterValidOwnerContact
source: Please enter a valid 10-digit owner contact number
hi: कृपया एक मान्य 10-अंकीय मालिक संपर्क नंबर दर्ज करें
ta: சரியான 10 இலக்க உரிமையாளர் தொடர்பு எண்ணை உள்ளிடவும்

# enterOwnerAddress
source: Please enter owner address
hi: कृपया मालिक का पता दर्ज करें
ta: உரிமையாளர் முகவரியை உள்ளிடவும்

# enterOwnerPincode
source: Please enter owner pincode
hi: कृपया मालिक का पिनकोड दर्ज करें
ta: உரிமையாளர் பின்கோடு உள்ளிடவும்

# enterValidOwnerPincode
source: Please enter a valid 6-digit owner pincode
hi: कृपया एक मान्य 6-अंकीय मालिक पिनकोड दर्ज करें
ta: சரியான 6 இலக்க உரிமையாளர் பின்கோடு உள்ளிடவும்

# enterOwnerCity
source: Please enter owner city
hi: कृपया मालिक का शहर दर्ज करें
ta: உரிமையாளர் நகரத்தை உள்ளிடவும்

# enterOwnerDistrict
source: Please enter owner district
hi: कृपया मालिक का जिला दर्ज करें
ta: உரிமையாளர் மாவட்டத்தை உள்ளிடவும்

# enterOwnerState
source: Please enter owner state
hi: कृपया मालिक का राज्य दर्ज करें
ta: உரிமையாளர் மாநிலத்தை உள்ளிடவும்

# enterValidPAN
source: Please enter a valid PAN number
hi: कृपया एक मान्य पैन नंबर दर्ज करें
ta: சரியான PAN எண்ணை உள்ளிடவும்

# uploadDrivingLicense
source: Please upload your driving license
hi: कृपया अपना ड्राइविंग लाइसेंस अपलोड करें
ta: உங்கள் ஓட்டுநர் உரிமத்தைப் பதிவேற்றவும்

# uploadRCBook
source: Please upload your RC book
hi: कृपया अपनी आरसी बुक अपलोड करें
ta: உங்கள் RC புத்தகத்தைப் பதிவேற்றவும்

# uploadFCCertificate
source: Please upload your FC certificate
hi: कृपया अपना एफसी प्रमाण पत्र अपलोड करें
ta: உங்கள் FC சான்றிதழைப் பதிவேற்றவும்

# uploadElectricityBill
source: Please upload your electricity bill
hi: कृपया अपना बिजली बिल अपलोड करें
ta: உங்கள் மின்சார பில்லைப் பதிவேற்றவும்

# enterPAN
source: Please enter your PAN number
hi: कृपया अपना पैन नंबर दर्ज करें
ta: உங்கள் PAN எண்ணை உள்ளிடவும்

# enterIFSCCode
source: Please enter IFSC code
hi: कृपया IFSC कोड दर्ज करें
ta: IFSC குறியீட்டை உள்ளிடவும்

# enterValidIFSC
source: Please enter a valid IFSC code
hi: कृपया एक मान्य IFSC कोड दर्ज करें
ta: சரியான IFSC குறியீட்டை உள்ளிடவும்

# enterUPIID
source: Please enter UPI ID (VPA)
hi: कृपया UPI ID (VPA) दर्ज करें
ta: UPI ID (VPA) உள்ளிடவும்

# enterValidUPI
source: Please enter a valid UPI ID
hi: कृपया एक मान्य UPI ID दर्ज करें
ta: சரியான UPI ID உள்ளிடவும்

source: Complete Setup
hi: सेटअप पूरा करें
ta: அமைப்பை முடி

# continueText
source: Continue
hi: जारी रखें
ta: தொடர்

# documentUploadedSuccess
source: Document uploaded successfully!
hi: दस्तावेज़ सफलतापूर्वक अपलोड किया गया!
ta: ஆவணம் வெற்றிகரமாக பதிவேற்றப்பட்டது!

# failedToPickDocument
source: Failed to pick document: {error}
hi: दस्तावेज़ चुनने में विफल: {error}
ta: ஆவணத்தைத் தேர்ந்தெடுப்பதில் தோல்வி: {error}

# failedToUploadDocument
source: Failed to upload document: {error}
hi: दस्तावेज़ अपलोड करने में विफल: {error}
ta: ஆவணத்தைப் பதிவேற்றுவதில் தோல்வி: {error}

# failedToPickImage
source: Failed to pick image: {error}
hi: छवि चुनने में विफल: {error}
ta: படத்தைத் தேர்ந்தெடுப்பதில் தோல்வி: {error}

# failedToUploadImage
source: Failed to upload profile picture: {error}
hi: प्रोफ़ाइल चित्र अपलोड करने में विफल: {error}
ta: சுயவிவர படத்தைப் பதிவேற்றுவதில் தோல்வி: {error}

source: Documents not found
hi: दस्तावेज़ नहीं मिले
ta: ஆவணங்கள் கிடைக்கவில்லை

# documentsNotUploadedYet
source: The documents may not be uploaded yet.
hi: दस्तावेज़ अभी तक अपलोड नहीं किए गए हैं।
ta: ஆவணங்கள் இன்னும் பதிவேற்றப்படவில்லை.
